tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jvanhare/gamma"
brew "antigen"
brew "automake"
brew "biber"
brew "lua"
brew "python"
brew "cmake"
brew "cppcheck"
brew "curl"
brew "doxygen"
brew "gcc"
brew "ffmpeg"
brew "node"
brew "gh"
brew "git"
brew "glab"
brew "qt"
brew "imagemagick"
brew "latexindent"
brew "lcov"
brew "llvm"
brew "lmod"
brew "neofetch"
brew "ninja"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "pipx"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh"
cask "font-fira-code"
cask "freecad"
cask "iterm2"
cask "skim"
cask "tex-live-utility"
cask "visual-studio-code"
cask "vizir4"
cask "vlc"
vscode "aaron-bond.better-comments"
vscode "adamvoss.vscode-languagetool"
vscode "adamvoss.vscode-languagetool-en"
vscode "B4dM4n.nixpkgs-fmt"
vscode "batisteo.vscode-django"
vscode "bbenoist.Doxygen"
vscode "bbenoist.Nix"
vscode "bierner.markdown-preview-github-styles"
vscode "Blamsoft.fprettify"
vscode "bradlc.vscode-tailwindcss"
vscode "brettm12345.nixfmt-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "cheshirekow.cmake-format"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "fortran-lang.linter-gfortran"
vscode "foxundermoon.shell-format"
vscode "gencay.vscode-chatgpt"
vscode "Gimly81.fortran"
vscode "golang.go"
vscode "hansec.fortran-ls"
vscode "iliazeus.vscode-ansi"
vscode "James-Yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jnbt.vscode-rufo"
vscode "jnoortheen.nix-ide"
vscode "josetr.cmake-language-support-vscode"
vscode "keyring.Lua"
vscode "kumar-harsh.graphql-for-vscode"
vscode "leafvmaple.octave"
vscode "lonefy.vscode-JS-CSS-HTML-formatter"
vscode "LucasFA.octaveexecution"
vscode "mhutchie.git-graph"
vscode "mohd-akram.vscode-html-format"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-fr"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "nickfode.latex-formatter"
vscode "nickytonline.gatsby-extension-pack"
vscode "nickytonline.vscode-gatsby-snippets"
vscode "PKief.material-icon-theme"
vscode "raymondcamden.languagetool"
vscode "rebornix.ruby"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "silvenon.mdx"
vscode "snakemake.snakemake-lang"
vscode "statiolake.vscode-rustfmt"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "sumneko.lua"
vscode "surajbarkale.ninja"
vscode "tamasfe.even-better-toml"
vscode "tcwalther.cython"
vscode "tfehlmann.snakefmt"
vscode "toasty-technologies.octave"
vscode "torn4dom4n.latex-support"
vscode "trond-snekvik.simple-rst"
vscode "tusindfryd.octave-formatter"
vscode "twxs.cmake"
vscode "vadistic.mdx-inline"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "wingrunr21.vscode-ruby"
vscode "xaver.clang-format"
vscode "yukiuuh.vscode-modern-fortran-formatter"
vscode "yukiuuh2936.vscode-modern-fortran-formatter"
vscode "zhang-renyang.chat-gpt"
