tap "carlocab/personal"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jvanhare/gamma"
brew "brotli"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argp-standalone"
brew "assimp"
brew "automake"
brew "biber"
brew "bison"
brew "boost"
brew "boost-bcp"
brew "libx11"
brew "lua"
brew "python@3.11"
brew "clingo"
brew "libsigsegv"
brew "cmake"
brew "tinyxml2"
brew "cppcheck"
brew "curl"
brew "doxygen"
brew "eigen"
brew "ghostscript"
brew "expat"
brew "gmp"
brew "mpfr"
brew "gcc"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libsodium"
brew "openblas"
brew "numpy", link: false
brew "pugixml"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "netpbm"
brew "findutils"
brew "flex"
brew "node"
brew "gatsby-cli"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "glab"
brew "gnu-sed"
brew "gnu-tar"
brew "qt"
brew "gnuplot"
brew "go"
brew "go-task"
brew "gomplate"
brew "goreleaser"
brew "gpgme"
brew "graphicsmagick"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "guile"
brew "hdf5"
brew "hugo"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "latexindent"
brew "lcov"
brew "libedit"
brew "libiconv"
brew "libmatio"
brew "libxft"
brew "libyaml"
brew "python@3.12"
brew "z3"
brew "llvm"
brew "six"
brew "llvm@16"
brew "lmod"
brew "lua@5.3"
brew "luajit"
brew "luarocks"
brew "mage"
brew "mesa"
brew "ncurses"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nushell"
brew "tcl-tk"
brew "opencascade"
brew "openjdk"
brew "openjdk@11"
brew "openslide"
brew "pandoc"
brew "pandoc-crossref"
brew "patchelf"
brew "pixz"
brew "poppler"
brew "qt@5"
brew "pyqt@5"
brew "python@3.10"
brew "qscintilla2"
brew "rapidjson"
brew "re2c"
brew "ruby"
brew "rust"
brew "rustfmt"
brew "sonar-scanner"
brew "tokei"
brew "vim"
brew "wget"
brew "yarn"
brew "yq"
brew "zola"
brew "zsh"
cask "font-fira-code"
cask "freecad"
cask "iterm2"
cask "mactex"
cask "skim"
cask "tex-live-utility"
cask "visual-studio-code"
cask "vizir4"
cask "vlc"
vscode "aaron-bond.better-comments"
vscode "adamvoss.vscode-languagetool"
vscode "adamvoss.vscode-languagetool-en"
vscode "B4dM4n.nixpkgs-fmt"
vscode "batisteo.vscode-django"
vscode "bbenoist.Doxygen"
vscode "bbenoist.Nix"
vscode "bierner.markdown-preview-github-styles"
vscode "Blamsoft.fprettify"
vscode "bradlc.vscode-tailwindcss"
vscode "brettm12345.nixfmt-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "cheshirekow.cmake-format"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "fortran-lang.linter-gfortran"
vscode "foxundermoon.shell-format"
vscode "gencay.vscode-chatgpt"
vscode "Gimly81.fortran"
vscode "golang.go"
vscode "hansec.fortran-ls"
vscode "iliazeus.vscode-ansi"
vscode "James-Yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jnbt.vscode-rufo"
vscode "jnoortheen.nix-ide"
vscode "josetr.cmake-language-support-vscode"
vscode "keyring.Lua"
vscode "kumar-harsh.graphql-for-vscode"
vscode "leafvmaple.octave"
vscode "lonefy.vscode-JS-CSS-HTML-formatter"
vscode "LucasFA.octaveexecution"
vscode "mhutchie.git-graph"
vscode "mohd-akram.vscode-html-format"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-fr"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "nickfode.latex-formatter"
vscode "nickytonline.gatsby-extension-pack"
vscode "nickytonline.vscode-gatsby-snippets"
vscode "PKief.material-icon-theme"
vscode "raymondcamden.languagetool"
vscode "rebornix.ruby"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "silvenon.mdx"
vscode "snakemake.snakemake-lang"
vscode "statiolake.vscode-rustfmt"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "sumneko.lua"
vscode "surajbarkale.ninja"
vscode "tamasfe.even-better-toml"
vscode "tcwalther.cython"
vscode "tfehlmann.snakefmt"
vscode "toasty-technologies.octave"
vscode "torn4dom4n.latex-support"
vscode "trond-snekvik.simple-rst"
vscode "tusindfryd.octave-formatter"
vscode "twxs.cmake"
vscode "vadistic.mdx-inline"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "wingrunr21.vscode-ruby"
vscode "xaver.clang-format"
vscode "yukiuuh.vscode-modern-fortran-formatter"
vscode "yukiuuh2936.vscode-modern-fortran-formatter"
vscode "zhang-renyang.chat-gpt"
